In [2]:
import pandas as pd
import numpy as np
data = {
    'Yil': [2021, 2020, 2019, 2018, 2017, 2016, 2015, 2010],
    'Aholi soni': [33.9, 33.5, 32.9, 32.5, 31.9, 31.4, 30.9, 28.5],
    'Temp' : [1.54, 1.48, 1.56, 1.62, 1.65, 1.66, 1.64, 1.53],
    'Zichlik' : [79.77, 78.68, 77.53, 76.34, 75.13, 73.91, 72.71, 67.03]
}
df = pd.DataFrame(data)

In [3]:
import numpy as np

In [4]:
df

    Yil  Aholi soni  Temp  Zichlik
0  2021        33.9  1.54    79.77
1  2020        33.5  1.48    78.68
2  2019        32.9  1.56    77.53
3  2018        32.5  1.62    76.34
4  2017        31.9  1.65    75.13
5  2016        31.4  1.66    73.91
6  2015        30.9  1.64    72.71
7  2010        28.5  1.53    67.03

In [5]:
data = df[['Aholi soni']]

In [9]:
df.dtypes

Yil             int64
Aholi soni    float64
Temp          float64
Zichlik       float64
dtype: object

In [5]:
data

   Aholi soni
0        33.9
1        33.5
2        32.9
3        32.5
4        31.9
5        31.4
6        30.9
7        28.5

In [6]:
data0 = df['Aholi soni']

In [7]:
data0

0    33.9
1    33.5
2    32.9
3    32.5
4    31.9
5    31.4
6    30.9
7    28.5
Name: Aholi soni, dtype: float64

In [11]:
data0[[1]]

1    33.5
Name: Aholi soni, dtype: float64

In [12]:
type(data0)

pandas.core.series.Series

In [13]:
data0[:4]

0    33.9
1    33.5
2    32.9
3    32.5
Name: Aholi soni, dtype: float64

In [14]:
data0[[0, 1, 2]]

0    33.9
1    33.5
2    32.9
Name: Aholi soni, dtype: float64

In [17]:
obj = pd.Series(np.arange(8.), index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [18]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [19]:
obj['a']

0.0

In [20]:
obj[['a']]

a    0.0
dtype: float64

In [21]:
obj[0:4]

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [22]:
obj['a':'f']

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [23]:
obj['a':'c'] = 15

In [24]:
obj

a    15.0
b    15.0
c    15.0
d     3.0
e     4.0
f     5.0
g     6.0
h     7.0
dtype: float64

In [25]:
obj[obj<15]

d    3.0
e    4.0
f    5.0
g    6.0
h    7.0
dtype: float64

In [26]:
obj[obj == 15]

a    15.0
b    15.0
c    15.0
dtype: float64

In [28]:
obj[obj<7]

d    3.0
e    4.0
f    5.0
g    6.0
dtype: float64

In [32]:
uz = {2020:33.5, 2019:32.9, 2018:32.5, 2017:31.9, 2016:31.4, 2015:30.9}
kz = {2020:18.8, 2019:18.5, 2018:18.3, 2017:18.1, 2016:17.8, 2015:17.6}
tj = {2020:9.5, 2019:9.3, 2018:9.1, 2017:8.9, 2016:8.7, 2015:8.5}
kg = {2020:6.5, 2019:6.4, 2018:6.3, 2017:6.2, 2016:6.1, 2015:6}
tr = {2020:6, 2019:5.9, 2018:5.9, 2017:5.8, 2016:5.6, 2015:5.6}

df = pd.DataFrame({
    'Uzbekistan':uz,
    'Kazakhstan':kz,
    'Tajikistan':tj,
    'Kyrgizistan':kg,
    'Turkmenistan':tr   
})

In [34]:
df#['Uzbekistan']

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2019        32.9        18.5         9.3          6.4           5.9
2018        32.5        18.3         9.1          6.3           5.9
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [39]:
df['Uzbekistan']#.to_numpy()

2020    33.5
2019    32.9
2018    32.5
2017    31.9
2016    31.4
2015    30.9
Name: Uzbekistan, dtype: float64

In [40]:
df[['Uzbekistan']]#to_numpy()

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5
2017        31.9
2016        31.4
2015        30.9

In [41]:
df[['Uzbekistan', 'Turkmenistan']]

      Uzbekistan  Turkmenistan
2020        33.5           6.0
2019        32.9           5.9
2018        32.5           5.9
2017        31.9           5.8
2016        31.4           5.6
2015        30.9           5.6

In [42]:
df[3:]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [43]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2019        32.9        18.5         9.3          6.4           5.9
2018        32.5        18.3         9.1          6.3           5.9
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [44]:
df>10

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        True        True       False        False         False
2019        True        True       False        False         False
2018        True        True       False        False         False
2017        True        True       False        False         False
2016        True        True       False        False         False
2015        True        True       False        False         False

In [46]:
df>20

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        True       False       False        False         False
2019        True       False       False        False         False
2018        True       False       False        False         False
2017        True       False       False        False         False
2016        True       False       False        False         False
2015        True       False       False        False         False

In [48]:
df>6.3

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        True        True        True         True         False
2019        True        True        True         True         False
2018        True        True        True        False         False
2017        True        True        True        False         False
2016        True        True        True        False         False
2015        True        True        True        False         False

In [49]:
df[['Uzbekistan']][df['Uzbekistan']>32]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [50]:
dfuz = df[['Uzbekistan']]

In [51]:
dfuz[dfuz['Uzbekistan']>32]

      Uzbekistan
2020        33.5
2019        32.9
2018        32.5

In [55]:
df2 = df.transpose(copy = True)
df2

              2020  2019  2018  2017  2016  2015
Uzbekistan    33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan    18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan     9.5   9.3   9.1   8.9   8.7   8.5
Kyrgizistan    6.5   6.4   6.3   6.2   6.1   6.0
Turkmenistan   6.0   5.9   5.9   5.8   5.6   5.6

In [58]:
#dfuz['Uzbekistan']>32

In [57]:
df2[df2[2015]>6]

            2020  2019  2018  2017  2016  2015
Uzbekistan  33.5  32.9  32.5  31.9  31.4  30.9
Kazakhstan  18.8  18.5  18.3  18.1  17.8  17.6
Tajikistan   9.5   9.3   9.1   8.9   8.7   8.5

In [59]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2019        32.9        18.5         9.3          6.4           5.9
2018        32.5        18.3         9.1          6.3           5.9
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [60]:
df[['Kazakhstan']]

      Kazakhstan
2020        18.8
2019        18.5
2018        18.3
2017        18.1
2016        17.8
2015        17.6

In [61]:
df.loc[2020]

Uzbekistan      33.5
Kazakhstan      18.8
Tajikistan       9.5
Kyrgizistan      6.5
Turkmenistan     6.0
Name: 2020, dtype: float64

In [62]:
df.loc[[2020, 2018]]

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2018        32.5        18.3         9.1          6.3           5.9

In [64]:
df.loc[[2015, 2020], ['Uzbekistan', 'Tajikistan']]

      Uzbekistan  Tajikistan
2015        30.9         8.5
2020        33.5         9.5

In [65]:
df

      Uzbekistan  Kazakhstan  Tajikistan  Kyrgizistan  Turkmenistan
2020        33.5        18.8         9.5          6.5           6.0
2019        32.9        18.5         9.3          6.4           5.9
2018        32.5        18.3         9.1          6.3           5.9
2017        31.9        18.1         8.9          6.2           5.8
2016        31.4        17.8         8.7          6.1           5.6
2015        30.9        17.6         8.5          6.0           5.6

In [72]:
df.iloc[[0, 4], [0, 3]]

      Uzbekistan  Kyrgizistan
2020        33.5          6.5
2016        31.4          6.1

In [74]:
df.iloc[3, 0]

31.9

In [75]:
df.at[2017, 'Uzbekistan']

31.9

In [76]:
df.iat[2, 1]

18.3

In [80]:
nums = list(range(10, 21))

In [81]:
nums

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [82]:
nums[0]

10

In [83]:
nums

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]

In [84]:
nums[-1]

20

In [85]:
obj = pd.Series(np.arange(10.))

In [86]:
obj[0]

0.0

In [88]:
obj

0    0.0
1    1.0
2    2.0
3    3.0
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [89]:
ser = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e']) #Index sonli bo'lsa -1 ishlamaydi harfli bo'lsa ishlaydi

In [90]:
ser[-1]

C:\Users\QuadroMi\AppData\Local\Temp\ipykernel_2456\3387420178.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[-1]

4.0

In [91]:
obj.iloc[-1]

9.0